#С помощью срезов необходимо вывести:
#- весь список;
#- нечётные по порядку элементы;
#- чётные по порядку элементы;
#- все элементы в обратном порядке;
#- все элементы, начиная с шестого;
#- все элементы, не доходя до шестого;
#- все элементы от предпоследнего до третьего в обратном порядке.
#Во всех случаях выборки от большего индекса к меньшему нужно указывать шаг!

str="string"
print(str[0:6])
str1="string"
print(str1[0:6:2])
str2="string"
print(str2[1:6:2])
str3="string"
print(str3[-1:-7:-1])
str4="string"
print(str4[-1:-7:-1])
str5="string"
print(str5[0:5])
str6="string"
print(str6[-2:-5:-1])
nun=float(2)
print(nun)

